  &НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаПоДокументу=Объект.ВыполненныеРаботы.Итог("Сумма");
КонецПроцедуры

    &НаКлиенте
Процедура ВыполненныеРаботыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ВыполненныеРаботы.ТекущиеДанные; 
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти); 
КонецПроцедуры  

&НаКлиенте
Процедура ВыполненныеРаботыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ВыполненныеРаботы.ТекущиеДанные; 
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти); 
КонецПроцедуры

  &НаКлиенте
Процедура ВыполненныеРаботыНаименованиеПриИзменении(Элемент)
СтрокаРасчета = Элементы.ВыполненныеРаботы.ТекущиеДанные;
СтрокаРасчета.Цена = ПолучитьЦену(СтрокаРасчета.Наименование);
ВыполненныеРаботыЦенаПриИзменении(Элемент);
КонецПроцедуры                 

  &НаСервере
функция ПолучитьЦену (НаименованиеДокумента)
СтруктураОтбора = Новый Структура;   
СтруктураОтбора.Вставить("Наименование", НаименованиеДокумента);
РезультатОтбора = РегистрыСведений.Цены.Получить(СтруктураОтбора);
Возврат РезультатОтбора.Цена;
КонецФункции
