
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Диагностика.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Диагностика.Автомобиль,
	|	Диагностика.Дата,
	|	Диагностика.ДиагностикуПровел,
	|	Диагностика.Клиент,
	|	Диагностика.Номер,
	|	Диагностика.РезультатДиагностики,
	|	Диагностика.СуммаПоДокументу,
	|	Диагностика.ВыполненныеРаботы.(
	|		НомерСтроки,
	|		Наименование,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Диагностика КАК Диагностика
	|ГДЕ
	|	Диагностика.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВыполненныеРаботыШапка = Макет.ПолучитьОбласть("ВыполненныеРаботыШапка");
	ОбластьВыполненныеРаботы = Макет.ПолучитьОбласть("ВыполненныеРаботы");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВыполненныеРаботыШапка);
		ВыборкаВыполненныеРаботы = Выборка.ВыполненныеРаботы.Выбрать();
		Пока ВыборкаВыполненныеРаботы.Следующий() Цикл
			ОбластьВыполненныеРаботы.Параметры.Заполнить(ВыборкаВыполненныеРаботы);
			ТабДок.Вывести(ОбластьВыполненныеРаботы, ВыборкаВыполненныеРаботы.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
