
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ГарантийныйРемонт.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГарантийныйРемонт.Автомобиль,
	|	ГарантийныйРемонт.Дата,
	|	ГарантийныйРемонт.Клиент,
	|	ГарантийныйРемонт.Механик,
	|	ГарантийныйРемонт.Номер,
	|	ГарантийныйРемонт.СуммаПоДокументу,
	|	ГарантийныйРемонт.ВыполненныеРаботы.(
	|		НомерСтроки,
	|		Наименование,
	|		Количество,
	|		Цена,
	|		Сумма
	|	),
	|	ГарантийныйРемонт.Номенклатура.(
	|		НомерСтроки,
	|		Наименование,
	|		Количество,
	|		Цена,
	|		Сумма,
	|		ГарантияДо
	|	)
	|ИЗ
	|	Документ.ГарантийныйРемонт КАК ГарантийныйРемонт
	|ГДЕ
	|	ГарантийныйРемонт.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВыполненныеРаботыШапка = Макет.ПолучитьОбласть("ВыполненныеРаботыШапка");
	ОбластьВыполненныеРаботы = Макет.ПолучитьОбласть("ВыполненныеРаботы");
	ОбластьНоменклатураШапка = Макет.ПолучитьОбласть("НоменклатураШапка");
	ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВыполненныеРаботыШапка);
		ВыборкаВыполненныеРаботы = Выборка.ВыполненныеРаботы.Выбрать();
		Пока ВыборкаВыполненныеРаботы.Следующий() Цикл
			ОбластьВыполненныеРаботы.Параметры.Заполнить(ВыборкаВыполненныеРаботы);
			ТабДок.Вывести(ОбластьВыполненныеРаботы, ВыборкаВыполненныеРаботы.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьНоменклатураШапка);
		ВыборкаНоменклатура = Выборка.Номенклатура.Выбрать();
		Пока ВыборкаНоменклатура.Следующий() Цикл
			ОбластьНоменклатура.Параметры.Заполнить(ВыборкаНоменклатура);
			ТабДок.Вывести(ОбластьНоменклатура, ВыборкаНоменклатура.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
