
Процедура ОбработкаПроведения(Отказ, Режим)
		// регистр ГарантийноеОбслуживание 
	Движения.ГарантийноеОбслуживание.Записывать = Истина;
	Для Каждого ТекСтрокаВыполненныеРаботы Из ВыполненныеРаботы Цикл
		Движение = Движения.ГарантийноеОбслуживание.Добавить();
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаВыполненныеРаботы.Наименование;
		Движение.Клиент = Клиент;
		Движение.Автомобиль = Автомобиль;
		Движение.Цена = ТекСтрокаВыполненныеРаботы.Цена;
		Движение.Количество = ТекСтрокаВыполненныеРаботы.Количество;
		Движение.СуммаПоДокументу = СуммаПоДокументу;
	КонецЦикла;

	// регистр ГарантийноеОбслуживание 
	Движения.ГарантийноеОбслуживание.Записывать = Истина;
	Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
		Движение = Движения.ГарантийноеОбслуживание.Добавить();
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаНоменклатура.Наименование;
		Движение.ГаранатияДо = ТекСтрокаНоменклатура.ГарантияДо;
		Движение.Клиент = Клиент;
		Движение.Автомобиль = Автомобиль;
		Движение.Цена = ТекСтрокаНоменклатура.Цена;
		Движение.Количество = ТекСтрокаНоменклатура.Количество;
		Движение.СуммаПоДокументу = СуммаПоДокументу;
	КонецЦикла;

КонецПроцедуры
